cf/Catalogs/ИнтернетСтатьи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ИнтернетСтатьи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоНовости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеСодержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСтатьи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСтатьи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКартинка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>alies</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактированиеТэгами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>h1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>meta_keywords</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>meta_description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>link_text</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>title_for_link</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтатьи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипИнтернетСтатьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаОтображенияНаСайте</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайтЛикота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРодители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнтернетСтатьи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/ИнтернетСтатьи/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВидмостьЭлементов()
	
	СТэгами = Объект.РедактированиеТэгами;

	Элементы.КнопкаВключитьУпращенныйРежим.Видимость 					= СТэгами;
	Элементы.КнопкаВключитьРежимРедактированияСПомощьюТэгов.Видимость 	= Не СТэгами;
	
	Элементы.ДлиныйТекстТэг.Видимость 	= СТэгами;
	Элементы.ДлиныйТекстВорд.Видимость 	= Не СТэгами;
	
	Элементы.КороткийТекстТэг.Видимость 	= СТэгами;
	Элементы.КороткийТекстВорд.Видимость 	= Не СТэгами;
	
КонецПроцедуры

// КАРТИНКА

&НаКлиенте
Процедура ПолученФайлКартинкиПредставления(Результат, текАдрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		
		АдресКартинки = текАдрес;
		Модифицированность = Истина; КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура КартинкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ПолученФайлКартинкиПредставления", ЭтаФорма),,"*.jpg;*.png", Истина, УникальныйИдентификатор); 
	
	//новАдресКартинки = "";
	//Если ПоместитьФайл(новАдресКартинки, "", "", Истина, УникальныйИдентификатор) Тогда
	//	АдресКартинки = новАдресКартинки;
	//	Модифицированность = Истина;
	//КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура КартинкаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыПеретаскивания.ДопустимыеДействия = ?(
					ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Файл"),
								ДопустимыеДействияПеретаскивания.Копирование,
								ДопустимыеДействияПеретаскивания.НеОбрабатывать);
	
КонецПроцедуры
&НаКлиенте
Процедура КартинкаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	АдресКартинки = "";
	Если ПоместитьФайл(АдресКартинки, ПараметрыПеретаскивания.Значение.ПолноеИмя, "", Ложь, УникальныйИдентификатор) Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

// ПРЕДОПРЕДЕЛЕННЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	GUID = Строка(Объект.Ссылка.УникальныйИдентификатор());
	АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Картинка");
	
	Если Не Объект.РедактированиеТэгами Тогда
	
		// Загрузим данные в короткий текст
		
		ДиалогиСПользователем.ЗагрузитьДанныеВФорматированныйДокумент(
								Объект,
								КортокийТекст,
								"Статьи",
								"КраткоеСодержание");
								
		// Загрузим данные в длинный текст
		
		ДиалогиСПользователем.ЗагрузитьДанныеВФорматированныйДокумент(
								Объект,
								ДлинныйТекст,
								"Статьи",
								"ТекстСтатьи");
								
	КонецЕсли;
							
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Обновим красивость
	
	ВидмостьЭлементов();
	
	// Получим картинку из базы
	
	АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Картинка");
		
КонецПроцедуры
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Запишем картинку
	
	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда
		
		ТекущийОбъект.Картинка = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресКартинки));
		
	КонецЕсли;
	
	Если Не ТекущийОбъект.РедактированиеТэгами Тогда
	
		// Запишем короткий текст

		ДиалогиСПользователем.ЗаписатьОтформатированныйДокументНаСервере(
							ТекущийОбъект,
							"Статьи",
							КортокийТекст,
							"КраткоеСодержание",
							"k");
							
		// Запишем длинный текст

		ДиалогиСПользователем.ЗаписатьОтформатированныйДокументНаСервере(
							ТекущийОбъект,
							"Статьи",
							ДлинныйТекст,
							"ТекстСтатьи",
							"d");
	КонецЕсли;
	
КонецПроцедуры

// КНОПКИ

&НаКлиенте
Процедура ВключитьРежимРедактированияСПомощьюТэгов(Команда)
	
	Если Вопрос("При переключении в режим Тэгов, может измениться форматирование существующих текстов, всеравно продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		// Перебросим в текст
		
		КортокийТекст.ПолучитьHTML(Объект.КраткоеСодержание, Новый Структура);
		ДлинныйТекст.ПолучитьHTML(Объект.ТекстСтатьи, Новый Структура);
		
		Объект.КраткоеСодержание 	= ДиалогиСПользователем.ПолучитьТелоHTML(Объект.КраткоеСодержание);
		Объект.ТекстСтатьи 			= ДиалогиСПользователем.ПолучитьТелоHTML(Объект.ТекстСтатьи);
		
		// Включим режим
		
		Объект.РедактированиеТэгами = Истина;
		
		// Установим элементы
		
		ВидмостьЭлементов();
		
	КонецЕсли;
		
КонецПроцедуры
&НаКлиенте
Процедура ВключитьУпращенныйРежим(Команда)
	
	Если Вопрос("При переключении в управщенный режим, может измениться форматирование существующих текстов, всеравно продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		// Перебросим в текст
		
		УстановитьТекстHTMLНаСервере();
		
		// Включим режим
		
		Объект.РедактированиеТэгами = Ложь;
		
		// Установим элементы
		
		ВидмостьЭлементов();
		
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура УстановитьТекстHTMLНаСервере()
	
	КортокийТекст.УстановитьHTML(ДиалогиСПользователем.СформироватьТекстHTML(Объект.КраткоеСодержание), Новый Структура);
	ДлинныйТекст.УстановитьHTML(ДиалогиСПользователем.СформироватьТекстHTML(Объект.ТекстСтатьи), Новый Структура);
			
КонецПроцедуры
